# Space_GetNetArea

## Description
Returns net area of given space object

```pascal
FUNCTION Space_GetNetArea(space : HANDLE): REAL;
```

```python
def vs.Space_GetNetArea(space):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools